#include "SceneManager.h"

#include "BaseScene.h"

/// ===================================================
/// インスタンス確保
/// ===================================================
SceneManager* SceneManager::GetInstance() {
	static SceneManager instance;
	return &instance;
}


/// ===================================================
/// 初期化
/// ===================================================
void SceneManager::Initialize() {

	
}


/// ===================================================
/// 更新
/// ===================================================
void SceneManager::Update() {

	if(scene_) {
		scene_->Update();
	}
}


/// ===================================================
/// 描画
/// ===================================================
void SceneManager::Draw() {

	if(scene_) {
		scene_->Draw();
	}
}


/// ===================================================
/// シーンのロード
/// ===================================================
void SceneManager::Load(BaseScene* next) {
	scene_.reset(next);
	scene_->Initialize();
}
